<?php
	/****************************************************
	*定义和启动
	*
	*
	*******************************************************/
	
	/************************ ↓包含文件↓ ************************/
	
	require_once("vendor/autoload.php");

	
	/************************* ↑包含文件↑ ***********************************/
	
	use App\Main;
	
	/************************ ↓定义常量↓ ************************/
	
	//获取域名或主机地址 
	define('APP_URL', Main::config('app.host')); 
	define('APP_DIR', dirname(__FILE__));
	define('APP_API' , isset($_GET['api'])?TRUE:FALSE);    //是否是API模式
	
	
	
	/************************* ↑定义常量↑ ***********************************/
	
	

	
	/************************ ↓执行文件中的方法↓ ************************/
	
	Main::out(APP_DIR);
	
	App\Lib\Lang::setLang();                                //加载语言包 
	
	if( !is_file( "app/conf/config.php" ) )
	{
		Main::redirect('/install.php');
	}
	
	session_start();                                  //打开session 因为所有的地方都会先判断session
	
	Main::getCAV();
	
	/************************* ↑执行文件中的方法↑ ***********************/
	
	
