<?php
	/****************************************************
	*定义和启动
	*
	*
	*******************************************************/
	
	
	
	/************************ ↓定义常量↓ ************************/
	
	//获取域名或主机地址 
	define('HTTP_HOST', $_SERVER['HTTP_HOST']); #localhost 
	
	define("NWAYSVIEW","include/view/");                         //定义视图目录
	
	/************************* ↑定义常量↑ ***********************************/
	
	
	/************************ ↓包含文件↓ ************************/
	
	include_once(NWAYS."function.php");                  //加载全局方法文件


	
	/************************* ↑包含文件↑ ***********************************/
	
	/************************ ↓执行文件中的方法↓ ************************/
	
	new Lang(getLang());                                 //加载语言包 
	
	if(!is_file(NWAYSCONF."config.php"))
	{
		redirect('/install.php');
	}
	
	session_start();                                  //打开session 因为所有的地方都会先判断session
	getCAV();
	
	/************************* ↑执行文件中的方法↑ ***********************/
	
	
